tukano-artillery-tests/logs/db-nosql-33.txt
--------------------------------
Summary report @ 18:36:54(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 331
errors.Failed capture or match: ................................................ 130
http.codes.200: ................................................................ 3221
http.codes.204: ................................................................ 1830
http.codes.500: ................................................................ 168
http.downloaded_bytes: ......................................................... 96
http.request_rate: ............................................................. 89/sec
http.requests: ................................................................. 5550
http.response_time:
  min: ......................................................................... 333
  max: ......................................................................... 9986
  mean: ........................................................................ 3436.4
  median: ...................................................................... 2618.1
  p95: ......................................................................... 8868.4
  p99: ......................................................................... 9607.1
http.response_time.2xx:
  min: ......................................................................... 333
  max: ......................................................................... 9986
  mean: ........................................................................ 3294.6
  median: ...................................................................... 2566.3
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 9607.1
http.response_time.5xx:
  min: ......................................................................... 3934
  max: ......................................................................... 9531
  mean: ........................................................................ 7700
  median: ...................................................................... 8024.5
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9416.8
http.responses: ................................................................ 5219
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.200: ..... 642
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.500: ..... 3
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.errors.ETIME...  14
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  649
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  10
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  4
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.200: .. 627
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.500: .. 9
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.errors.ET...  9
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.code...  659
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.200: ........ 630
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.500: ........ 5
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.errors.ETIMEDOUT: . 1
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.204:  528
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.500:  1
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.errors....  106
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  653
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  10
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 663
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.500: ....... 130
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.errors.ETIMEDOUT:  197
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/likes?pwd=pwd:
  min: ......................................................................... 679
  max: ......................................................................... 9986
  mean: ........................................................................ 3363.3
  median: ...................................................................... 2416.8
  p95: ......................................................................... 8868.4
  p99: ......................................................................... 9607.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd:
  min: ......................................................................... 894
  max: ......................................................................... 9936
  mean: ........................................................................ 3485.5
  median: ...................................................................... 3011.6
  p95: ......................................................................... 8024.5
  p99: ......................................................................... 9607.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/feed?pwd=pwd:
  min: ......................................................................... 863
  max: ......................................................................... 9924
  mean: ........................................................................ 3563
  median: ...................................................................... 3011.6
  p95: ......................................................................... 8692.8
  p99: ......................................................................... 9607.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/followers?pwd=pwd:
  min: ......................................................................... 371
  max: ......................................................................... 9458
  mean: ........................................................................ 2686.2
  median: ...................................................................... 1826.6
  p95: ......................................................................... 7557.1
  p99: ......................................................................... 8692.8
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 417
  max: ......................................................................... 9699
  mean: ........................................................................ 2360
  median: ...................................................................... 1939.5
  p95: ......................................................................... 6569.8
  p99: ......................................................................... 8186.6
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts?pwd=pwd:
  min: ......................................................................... 1174
  max: ......................................................................... 9974
  mean: ........................................................................ 5478.1
  median: ...................................................................... 5378.9
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9801.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd:
  min: ......................................................................... 443
  max: ......................................................................... 9085
  mean: ........................................................................ 2822.5
  median: ...................................................................... 2186.8
  p95: ......................................................................... 7557.1
  p99: ......................................................................... 8692.8
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 333
  max: ......................................................................... 9537
  mean: ........................................................................ 3990.3
  median: ...................................................................... 2566.3
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9416.8
vusers.completed: .............................................................. 529
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 461
vusers.session_length:
  min: ......................................................................... 8450.9
  max: ......................................................................... 45190.2
  mean: ........................................................................ 28895.7
  median: ...................................................................... 31897.9
  p95: ......................................................................... 40550.5
  p99: ......................................................................... 43058.1